DataProcessors/ЗаполнениеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеНоменклатуры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>шт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>кг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>л</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>м</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаполнениеНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
Процедура СоздатьТестовуюНоменклатуру()
	
	// 1. Проверка и создание Налоговых групп (НСИ)
	Группа20 = ПолучитьИлиСоздатьНалоговуюГруппу("Основная (20%)");
	ГруппаБезНДС = ПолучитьИлиСоздатьНалоговуюГруппу("Без НДС");
	
	// 2. Создание папки для товаров
	Родитель = Справочники.Номенклатура.НайтиПоНаименованию("Тестовые товары");
	Если Родитель.Пустая() Тогда
		Гр = Справочники.Номенклатура.СоздатьГруппу();
		Гр.Наименование = "Тестовые товары";
		Гр.Записать();
		Родитель = Гр.Ссылка;
	КонецЕсли;
	
	// 3. Генерация товаров согласно ТЗ
	// А) Обычный товар
	СоздатьТовар(
		"Товар Обычный (Хлеб)", 
		Родитель, 
		Перечисления.ЕдиницыИзмерения.шт, 
		Перечисления.СтавкиНДС.НДС20, 
		Группа20, 
		Ложь, // Акциз
		"",   // Код ВЭД
		30    // Наценка
	);
		
	// Б) Социальный товар
	СоздатьТовар(
		"Товар Социальный (Молоко)", 
		Родитель, 
		Перечисления.ЕдиницыИзмерения.шт, 
		Перечисления.СтавкиНДС.БезНДС, 
		ГруппаБезНДС, 
		Ложь, 
		"", 
		15
	);
	
	// В) Акцизный товар
	СоздатьТовар(
		"Товар Акцизный (Водка)", 
		Родитель, 
		Перечисления.ЕдиницыИзмерения.л, 
		Перечисления.СтавкиНДС.НДС20, 
		Группа20, 
		Истина, 
		"2208601100", 
		50
	);

КонецПроцедуры

Функция ПолучитьИлиСоздатьНалоговуюГруппу(Имя)
	
	Ссылка = Справочники.НалоговыеГруппы.НайтиПоНаименованию(Имя);
	Если Ссылка.Пустая() Тогда
		Эл = Справочники.НалоговыеГруппы.СоздатьЭлемент();
		Эл.Наименование = Имя;
		Эл.Записать();
		Возврат Эл.Ссылка;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Процедура СоздатьТовар(Имя, Родитель, ЕдИзм, Ставка, НалогГруппа, Акциз, КодВЭД, Наценка)
	
	ТоварСсылка = Справочники.Номенклатура.НайтиПоНаименованию(Имя);
	Если Не ТоварСсылка.Пустая() Тогда
		Возврат; // Уже есть
	КонецЕсли;
	
	Товар = Справочники.Номенклатура.СоздатьЭлемент();
	Товар.Наименование = Имя;
	Товар.Родитель = Родитель;
	Товар.Артикул = "TEST-" + Лев(КодВЭД + "001", 5);
	Товар.ЕдиницаИзмерения = ЕдИзм;
	Товар.СтавкаНДС = Ставка;
	Товар.НалоговаяГруппа = НалогГруппа;
	Товар.ТребуетАкцизнуюМарку = Акциз;
	Товар.КодУКТЗЕД = КодВЭД;
	Товар.ПроцентНаценки = Наценка;
	Товар.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовуюНоменклатуру1(Команда)
	СоздатьТестовуюНоменклатуру();
КонецПроцедуры
